{
    "ESPHomeCommunityLink": "Para obtener más información sobre ESPHome, configuración de ejemplo y enlaces a comunidades, visite:",
    "chkEnableESPHome": "Habilitar el panel ESPHome",
    "cnfDeleteYamlCancel": "Cancel",
    "cnfDeleteYamlOk": "Delete",
    "cnfDeleteYamlText": "Are you sure you want to delete this file?",
    "cnfDeleteYamlTitle": "Confirm file deletion",
    "existDevicesHeader": "Todos los dispositivos gestionados por este adaptador y su estado de conexión.",
    "hlpDiscoveryListeningAddress": "Descubrir solo dispositivos en esta interfaz",
    "hlpESPHomeDashboardVersion": "Elija qué versión de ESPHome Dashboard debe usarse",
    "hlpPillowVersion": "Choose which version of Pillow must be used",
    "hlpInputApiPassword": "Contraseña de API (heredada, ¡use una clave de cifrado!)",
    "hlpInputDeviceIP": "Seleccione el dispositivo existente o ingrese la IP del nuevo dispositivo",
    "hlpInputEncryptionKey": "Proporcionar clave de cifrado específica del dispositivo (preferido)",
    "hlpSelectedFilename": "Enter the filename from the table above to download or delete it",
    "introLine-1": "ioBroker ESPHome permite administrar y controlar dispositivos compatibles con ESPHome. ¡Debe crear y cargar estos archivos binarios usted mismo!",
    "introLine-2": "Se requiere ESPHome Dashboard para crear estos archivos binarios. ",
    "lblApiPass": "Contraseña API nativa predeterminada (heredada)",
    "lblAutoDiscovery": "Descubrimiento de dispositivos habilitado",
    "lblConnectDetails-Line-1": "La API nativa de ESPHome se utiliza para comunicarse directamente con los clientes, con un protocolo de red altamente optimizado. ",
    "lblConnectDetails-Line-2": "Después de agregar una línea api: a su configuración de ESPHome, puede ir a esta página y esperar a que aparezca el dispositivo ESPHome en la sección de dispositivos descubiertos (puede tardar hasta 5 minutos) o agregar el dispositivo manualmente eligiendo \"agregar dispositivo\". ",
    "lblConnectDetails-Line-3": "La API nativa de ESPHome se basa en un protocolo TCP personalizado que utiliza buffers de protocolo. ",
    "lblConnectIobroker": "ioBroker se comunica directamente mediante API nativa en lugar de MQTT para brindarle la mejor experiencia posible y soporte de claves de cifrado (recomendado) en lugar de contraseñas API/MQTT",
    "lblDashboardLink": "Para mostrar el panel de ESPHome en la pestaña de administración de ioBroker, es necesario proporcionar la IP-Ares en la que se está ejecutando la instalación.",
    "lblDefaultCredentials": "Dispositivos de configuración de claves de cifrado/API predeterminados (no recomendado)",
    "lblDefaultCredentials-Line-1": "Cada dispositivo debe tener su propia clave de cifrado única (recomendada) o contraseña API; la detección de dispositivos (cuando está habilitada) detecta todos los dispositivos e intenta conectarse con las siguientes credenciales",
    "lblDefaultCredentials-Line-2": "Si asigna una clave de cifrado única (recomendada) o una contraseña API, los nuevos dispositivos aparecerán en la pestaña Dispositivos descubiertos (o deberán agregarse) y deberá proporcionar las credenciales únicas manualmente.",
    "lblDelDevice": "Eliminar dispositivo",
    "lblDeleteYamlButton": "Delete File",
    "lblDevicesTable": "Todos los dispositivos actuales (conocidos) y su estado de conexión",
    "lblDiscoveryListeningAddress": "dirección de escucha",
    "lblDownloadYamlButton": "Download File",
    "lblESPHomeDashboardVersion": "Versión del panel ESPHome",
    "lblPillowVersion": "Pillow version",
    "lblESPHomeIP": "Dirección IP donde se ejecuta ESPHome Dashboard para integrarse en ioBroker Admin",
    "lblESPHomePort": "Puerto de ESPHome Dashboard",
    "lblEnableESPHome": "Puede ejecutar ESPHome Dashboard por separado o activar la siguiente opción para ejecutarlo de forma nativa en ioBroker.",
    "lblEncryptionKey": "Clave de cifrado predeterminada",
    "lblFileActionsHeader": "File Actions",
    "lblHeaderConnect": "Cómo conectar un dispositivo compatible con ESPHome a ioBroker",
    "lblHeaderMainPage": "Integración del panel ESPHome",
    "lblHeaderYamlManagement": "YAML File Management",
    "lblIgnoreList": "Direcciones IP que se excluirán mediante el descubrimiento de dispositivos",
    "lblInputApiPassword": "Contraseña API",
    "lblInputDeviceIP-content": "Dirección IP del dispositivo",
    "lblInputEncryptionKey": "Clave de encriptación",
    "lblLoadDevices": "Actualizar descripción general del dispositivo",
    "lblRefreshYamlFiles": "Refresh File List",
    "lblSelectedFilename": "Select file for download/delete",
    "lblTxtNoButtonsIfNotActive": "La tabla de dispositivos y el botón AGREGAR/Eliminar solo están disponibles si el adaptador está en ejecución",
    "lblUploadContent": "YAML Content",
    "lblUploadFilename": "Filename (e.g., my-device.yaml)",
    "lblUploadYamlButton": "Upload File",
    "lblUploadYamlHeader": "Upload YAML File",
    "lblUploadYamlInfo": "Paste the content of your YAML file below and provide a filename to upload it to the ESPHome directory.",
    "lblYamlFileUpload": "Upload YAML File",
    "lblYamlFilesHeader": "Available YAML Files",
    "lblYamlFilesTable": "YAML files in ESPHome directory",
    "lblYamlManagementInfo": "Upload, download, and manage YAML configuration files for your ESPHome devices. Files are stored in the ESPHome directory and can be used by the ESPHome Dashboard.",
    "lbl_addUpdateDevice": "AGREGAR / Modificar dispositivos",
    "maxRetry": "Reintento máximo de conexión antes de considerar el dispositivo como fuera de línea",
    "newDevicesHeader": "Dispositivos recién descubiertos, proporcione credenciales.",
    "reConInterval": "Configuración entre intentos de ioBroker para volver a conectar este dispositivo",
    "lblClearAutopyCache": "Clear Autopy Cache",
    "hlpClearAutopyCache": "Clear the autopy cache directory. This can help resolve issues with the ESPHome Dashboard not loading properly.",
    "cnfClearCacheText": "Are you sure you want to clear the autopy cache? This will remove all cached Python environments and ESPHome installations.",
    "cnfClearCacheTitle": "Confirm cache clearing",
    "cnfClearCacheOk": "Clear Cache",
    "cnfClearCacheCancel": "Cancel",
    "lblConfigStates": "Show configuration states",
    "hlpConfigStates": "Create configuration states for each entity to show device configuration details"
}
