{
    "ESPHomeCommunityLink": "Ga voor meer informatie over ESPHome, voorbeeldconfiguratie en links naar communities naar:",
    "chkEnableESPHome": "Schakel ESPHome-dashboard in",
    "existDevicesHeader": "Alle apparaten die door deze adapter worden beheerd en hun verbindingsstatus",
    "hlpDiscoveryListeningAddress": "Ontdek alleen apparaten op deze interface",
    "hlpESPHomeDashboardVersion": "Kies welke versie van ESPHome Dashboard gebruikt moet worden",
    "hlpInputApiPassword": "API-wachtwoord (verouderd, gebruik een coderingssleutel!)",
    "hlpInputDeviceIP": "Selecteer bestaand apparaat of voer IP van nieuw apparaat in",
    "hlpInputEncryptionKey": "Geef apparaatspecifieke coderingssleutel op (bij voorkeur)",
    "introLine-1": "Met ioBroker ESPHome kunt u ESPHome-compatibele apparaten beheren en controleren. U moet deze binaire bestanden zelf maken en uploaden!",
    "introLine-2": "ESPHome Dashboard is vereist om deze binaire bestanden te bouwen. ",
    "lblApiPass": "API-wachtwoord (verouderd)",
    "lblAutoDiscovery": "Apparaatdetectie ingeschakeld",
    "lblConnectDetails-Line-1": "De native API van ESPHome wordt gebruikt om rechtstreeks met klanten te communiceren, met een sterk geoptimaliseerd netwerkprotocol. ",
    "lblConnectDetails-Line-2": "Na het toevoegen van een api: lijn aan uw ESPHome-configuratie kunt u naar deze pagina gaan en wachten tot het ESPHome-apparaat verschijnt onder het gedeelte met ontdekte apparaten (kan tot 5 minuten duren) of het apparaat handmatig toevoegen door \"Apparaat toevoegen\" te kiezen ",
    "lblConnectDetails-Line-3": "De native API van ESPHome is gebaseerd op een aangepast TCP-protocol dat gebruik maakt van protocolbuffers. ",
    "lblConnectIobroker": "ioBroker communiceert rechtstreeks via Native API in plaats van MQTT om u de best mogelijke ervaring en ondersteuning te bieden met coderingssleutels (aanbevolen) in plaats van API/MQTT-wachtwoorden",
    "lblDashboardLink": "Om het ESPHome-dashboard op het ioBroker-beheertabblad weer te geven, is het vereist om de IP-Ares op te geven waarop de installatie wordt uitgevoerd",
    "lblDefaultCredentials": "Standaard API-/encryptiesleutelinstellingen apparaten (niet aanbevolen)",
    "lblDefaultCredentials-Line-1": "Elk apparaat moet zijn eigen unieke coderingssleutel (aanbevolen) of API-wachtwoord hebben. Apparaatdetectie (indien ingeschakeld) detecteert alle apparaten en probeert verbinding te maken met onderstaande inloggegevens",
    "lblDefaultCredentials-Line-2": "Als u een unieke coderingssleutel (aanbevolen) of API-wachtwoord toewijst, verschijnen nieuwe apparaten op het tabblad Ontdekte apparaten (of moeten ze worden toegevoegd) en moet u de unieke inloggegevens handmatig opgeven",
    "lblDelDevice": "Apparaat verwijderen",
    "lblDevicesTable": "Alle huidige (bekende) apparaten en hun verbindingsstatus",
    "lblDiscoveryListeningAddress": "Luisteradres",
    "lblESPHomeDashboardVersion": "ESPHome Dashboard-versie",
    "lblESPHomeIP": "IP-adres waar ESPHome Dashboard wordt uitgevoerd om te integreren in ioBroker Admin",
    "lblESPHomePort": "Haven van ESPHome-dashboard",
    "lblEnableESPHome": "U kunt ESPHome Dashboard afzonderlijk uitvoeren of de onderstaande optie activeren om het native in ioBroker uit te voeren",
    "lblEncryptionKey": "Standaard coderingssleutel",
    "lblHeaderConnect": "Een ESPHome-compatibel apparaat verbinden met ioBroker",
    "lblHeaderMainPage": "ESPHome Dashboard-integratie",
    "lblHeaderYamlManagement": "YAML File Management",
    "lblIgnoreList": "IP-adressen moeten worden uitgesloten bij apparaatdetectie",
    "lblInputApiPassword": "API-wachtwoord",
    "lblInputDeviceIP-content": "Apparaat IP-adres",
    "lblInputEncryptionKey": "Encryptiesleutel",
    "lblLoadDevices": "Apparaatoverzicht vernieuwen",
    "lblRefreshYamlFiles": "Refresh File List",
    "lblTxtNoButtonsIfNotActive": "Apparaattabel en knop TOEVOEGEN/verwijderen alleen beschikbaar als de adapter actief is",
    "lblUploadYamlHeader": "Upload YAML File",
    "lblYamlFileUpload": "Upload YAML File",
    "lblYamlFilesHeader": "Available YAML Files",
    "lblYamlFilesTable": "YAML files in ESPHome directory",
    "lblYamlManagementInfo": "Upload, download, and manage YAML configuration files for your ESPHome devices. Files are stored in the ESPHome directory and can be used by the ESPHome Dashboard.",
    "lbl_addUpdateDevice": "Apparaten toevoegen/wijzigen",
    "maxRetry": "Maximale verbindingspoging voordat het apparaat als offline wordt beschouwd",
    "newDevicesHeader": "Nieuw ontdekte apparaten, geef uw inloggegevens op!",
    "reConInterval": "Instelling tussen ioBroker-pogingen om dit apparaat opnieuw te verbinden"
}
