{
    "ESPHomeCommunityLink": "Weitere Informationen zu ESPHome, Beispielkonfigurationen und Links zu Communities sind hier zu finden:",
    "chkEnableESPHome": "ESPHome-Dashboard aktivieren",
    "cnfDeleteYamlCancel": "Cancel",
    "cnfDeleteYamlOk": "Delete",
    "cnfDeleteYamlText": "Are you sure you want to delete this file?",
    "cnfDeleteYamlTitle": "Confirm file deletion",
    "existDevicesHeader": "Alle von diesem Adapter verwalteten Geräte und deren Verbindungsstatus",
    "hlpDiscoveryListeningAddress": "Nur Geräte auf dieser Schnittstelle erkennen",
    "hlpESPHomeDashboardVersion": "Auswählen welche Version von ESPHome Dashboard verwendet werden soll",
    "hlpPillowVersion": "Wählen Sie aus, welche Version von Pillow verwendet werden soll",
    "hlpInputApiPassword": "API-Passwort (alt, bitte Verschlüsselungsschlüssel verwenden!)",
    "hlpInputDeviceIP": "Ein vorhandenes Gerät auswählen oder die IP des neuen Geräts eingeben",
    "hlpInputEncryptionKey": "Einen gerätespezifischen Verschlüsselungsschlüssel angeben (bevorzugt)",
    "hlpSelectedFilename": "Enter the filename from the table above to download or delete it",
    "introLine-1": "Mit ioBroker ESPHome kann man ESPHome-fähige Geräte verwalten und steuern. Diese Binärdateien müssen selbst erstellt und hochgeladen werden!",
    "introLine-2": "Zum Erstellen dieser Binärdateien ist ESPHome Dashboard erforderlich.",
    "lblApiPass": "API-Passwort (Legacy)",
    "lblAutoDiscovery": "Geräteerkennung aktiviert",
    "lblConnectDetails-Line-1": "Die native ESPHome-API wird für die direkte Kommunikation mit Clients über ein hochoptimiertes Netzwerkprotokoll verwendet.",
    "lblConnectDetails-Line-2": "Nachdem der ESPHome-Konfiguration eine api:-Zeile hinzugefügt wurde, kann man zu dieser Seite gehen und warten, bis das ESPHome-Gerät im Abschnitt „Erkannte Geräte“ angezeigt wird (kann bis zu 5 Minuten dauern) oder das Gerät manuell hinzugefügt werden, indem man „Gerät hinzufügen“ wählt.",
    "lblConnectDetails-Line-3": "Die native API von ESPHome basiert auf einem benutzerdefinierten TCP-Protokoll unter Verwendung von Protokollpuffern.",
    "lblConnectIobroker": "ioBroker kommuniziert direkt über die native API statt über MQTT, um Ihnen das bestmögliche Erlebnis und die Unterstützung von Verschlüsselungsschlüsseln (empfohlen) anstelle von API/MQTT-Passwörtern zu bieten",
    "lblDashboardLink": "Um das ESPHome-Dashboard auf der Admin-Registerkarte von ioBroker anzuzeigen, müssen Sie die IP-Adresse angeben, auf der die Installation ausgeführt wird",
    "lblDefaultCredentials": "Standard-API-/Verschlüsselungsschlüssel-Einstellungsgeräte (nicht empfohlen)",
    "lblDefaultCredentials-Line-1": "Jedes Gerät sollte über einen eigenen eindeutigen Verschlüsselungsschlüssel (empfohlen) oder ein API-Passwort verfügen. Die Geräteerkennung (sofern aktiviert) erkennt alle Geräte und versucht, eine Verbindung mit den unten aufgeführten Anmeldeinformationen herzustellen",
    "lblDefaultCredentials-Line-2": "Wenn Sie einen eindeutigen Verschlüsselungsschlüssel (empfohlen) oder ein API-Passwort zuweisen, werden neue Geräte auf der Registerkarte „Erkannte Geräte“ angezeigt (oder müssen hinzugefügt werden) und Sie müssen die eindeutigen Anmeldeinformationen manuell eingeben",
    "lblDelDevice": "Gerät löschen",
    "lblDeleteYamlButton": "Delete File",
    "lblDevicesTable": "Alle aktuellen (bekannten) Geräte und deren Verbindungsstatus",
    "lblDiscoveryListeningAddress": "Anhörungsadresse",
    "lblDownloadYamlButton": "Download File",
    "lblESPHomeDashboardVersion": "ESPHome Dashboard-Version",
    "lblPillowVersion": "Pillow-Version",
    "lblESPHomeIP": "IP-Adresse, unter der ESPHome Dashboard zur Integration in ioBroker Admin ausgeführt wird",
    "lblESPHomePort": "Port des ESPHome-Dashboards",
    "lblEnableESPHome": "Sie können ESPHome Dashboard entweder separat ausführen oder die Option unten aktivieren, um es nativ in ioBroker auszuführen",
    "lblEncryptionKey": "Standardverschlüsselungsschlüssel",
    "lblFileActionsHeader": "File Actions",
    "lblHeaderConnect": "So verbinden Sie ein ESPHome-fähiges Gerät mit ioBroker",
    "lblHeaderMainPage": "ESPHome Dashboard-Integration",
    "lblHeaderYamlManagement": "YAML File Management",
    "lblIgnoreList": "IP-Adressen, die von der Geräteerkennung ausgeschlossen werden sollen",
    "lblInputApiPassword": "API-Passwort",
    "lblInputDeviceIP-content": "Geräte-IP-Adresse",
    "lblInputEncryptionKey": "Verschlüsselungsschlüssel",
    "lblLoadDevices": "Geräteübersicht aktualisieren",
    "lblRefreshYamlFiles": "Refresh File List",
    "lblSelectedFilename": "Select file for download/delete",
    "lblTxtNoButtonsIfNotActive": "Gerätetabelle und Schaltfläche HINZUFÜGEN/Löschen nur verfügbar, wenn der Adapter ausgeführt wird",
    "lblUploadContent": "YAML Content",
    "lblUploadFilename": "Filename (e.g., my-device.yaml)",
    "lblUploadYamlButton": "Upload File",
    "lblUploadYamlHeader": "Upload YAML File",
    "lblUploadYamlInfo": "Paste the content of your YAML file below and provide a filename to upload it to the ESPHome directory.",
    "lblYamlFileUpload": "Upload YAML File",
    "lblYamlFilesHeader": "Available YAML Files",
    "lblYamlFilesTable": "YAML files in ESPHome directory",
    "lblYamlManagementInfo": "Upload, download, and manage YAML configuration files for your ESPHome devices. Files are stored in the ESPHome directory and can be used by the ESPHome Dashboard.",
    "lbl_addUpdateDevice": "Geräte hinzufügen/ändern",
    "maxRetry": "Maximale Verbindungswiederholung, bevor das Gerät als offline betrachtet wird",
    "newDevicesHeader": "Neu entdeckte Geräte, bitte Anmeldedaten angeben!",
    "reConInterval": "Einstellung zwischen ioBroker versucht, dieses Gerät erneut zu verbinden",
    "lblClearAutopyCache": "Autopy-Cache leeren",
    "hlpClearAutopyCache": "Löscht das autopy-Cache-Verzeichnis. Dies kann helfen, Probleme mit dem ESPHome Dashboard zu lösen.",
    "cnfClearCacheText": "Sind Sie sicher, dass Sie den autopy-Cache leeren möchten? Dies entfernt alle zwischengespeicherten Python-Umgebungen und ESPHome-Installationen.",
    "cnfClearCacheTitle": "Cache-Leerung bestätigen",
    "cnfClearCacheOk": "Cache leeren",
    "cnfClearCacheCancel": "Abbrechen",
    "lblConfigStates": "Konfigurationszustände anzeigen",
    "hlpConfigStates": "Konfigurationszustände für jede Entität erstellen, um Gerätekonfigurationsdetails anzuzeigen",
    "lblRgbAutoWhite": "Auto-Weißkanal für RGBW-Leuchten",
    "hlpRgbAutoWhite": "Wenn aktiviert, wird beim Setzen von colorHEX auf #ffffff bei RGBW-Leuchten automatisch der Weißkanal aktiviert und RGB auf null gesetzt. Beim Setzen einer anderen Farbe wird der Weißkanal deaktiviert."
}
