{
    "ESPHomeCommunityLink": "Weitere Informationen zu ESPHome, Beispielkonfigurationen und Links zu Communities finden Sie unter:",
    "chkEnableESPHome": "Aktivieren Sie das ESPHome-Dashboard",
    "existDevicesHeader": "Alle von diesem Adapter verwalteten Geräte und deren Verbindungsstatus",
    "hlpDiscoveryListeningAddress": "Erkennen Sie nur Geräte auf dieser Schnittstelle",
    "hlpESPHomeDashboardVersion": "Wählen Sie aus, welche Version von ESPHome Dashboard verwendet werden soll",
    "hlpInputApiPassword": "API-Passwort (alt, bitte Verschlüsselungsschlüssel verwenden!)",
    "hlpInputDeviceIP": "Wählen Sie ein vorhandenes Gerät aus oder geben Sie die IP des neuen Geräts ein",
    "hlpInputEncryptionKey": "Geben Sie einen gerätespezifischen Verschlüsselungsschlüssel an (bevorzugt)",
    "introLine-1": "Mit ioBroker ESPHome können Sie ESPHome-fähige Geräte verwalten und steuern. Sie müssen diese Binärdateien selbst erstellen und hochladen!",
    "introLine-2": "Zum Erstellen dieser Binärdateien ist ESPHome Dashboard erforderlich.",
    "lblApiPass": "API-Passwort (Legacy)",
    "lblAutoDiscovery": "Geräteerkennung aktiviert",
    "lblConnectDetails-Line-1": "Die native ESPHome-API wird für die direkte Kommunikation mit Clients über ein hochoptimiertes Netzwerkprotokoll verwendet.",
    "lblConnectDetails-Line-2": "Nachdem Sie Ihrer ESPHome-Konfiguration eine api:-Zeile hinzugefügt haben, können Sie zu dieser Seite gehen und warten, bis das ESPHome-Gerät im Abschnitt „Erkannte Geräte“ angezeigt wird (kann bis zu 5 Minuten dauern) oder das Gerät manuell hinzufügen, indem Sie „Gerät hinzufügen“ wählen.",
    "lblConnectDetails-Line-3": "Die native API von ESPHome basiert auf einem benutzerdefinierten TCP-Protokoll unter Verwendung von Protokollpuffern.",
    "lblConnectIobroker": "ioBroker kommuniziert direkt über die native API statt über MQTT, um Ihnen das bestmögliche Erlebnis und die Unterstützung von Verschlüsselungsschlüsseln (empfohlen) anstelle von API/MQTT-Passwörtern zu bieten",
    "lblDashboardLink": "Um das ESPHome-Dashboard auf der Admin-Registerkarte von ioBroker anzuzeigen, müssen Sie die IP-Adresse angeben, auf der die Installation ausgeführt wird",
    "lblDefaultCredentials": "Standard-API-/Verschlüsselungsschlüssel-Einstellungsgeräte (nicht empfohlen)",
    "lblDefaultCredentials-Line-1": "Jedes Gerät sollte über einen eigenen eindeutigen Verschlüsselungsschlüssel (empfohlen) oder ein API-Passwort verfügen. Die Geräteerkennung (sofern aktiviert) erkennt alle Geräte und versucht, eine Verbindung mit den unten aufgeführten Anmeldeinformationen herzustellen",
    "lblDefaultCredentials-Line-2": "Wenn Sie einen eindeutigen Verschlüsselungsschlüssel (empfohlen) oder ein API-Passwort zuweisen, werden neue Geräte auf der Registerkarte „Erkannte Geräte“ angezeigt (oder müssen hinzugefügt werden) und Sie müssen die eindeutigen Anmeldeinformationen manuell eingeben",
    "lblDelDevice": "Gerät löschen",
    "lblDevicesTable": "Alle aktuellen (bekannten) Geräte und deren Verbindungsstatus",
    "lblDiscoveryListeningAddress": "Anhörungsadresse",
    "lblESPHomeDashboardVersion": "ESPHome Dashboard-Version",
    "lblESPHomeIP": "IP-Adresse, unter der ESPHome Dashboard zur Integration in ioBroker Admin ausgeführt wird",
    "lblESPHomePort": "Port des ESPHome-Dashboards",
    "lblEnableESPHome": "Sie können ESPHome Dashboard entweder separat ausführen oder die Option unten aktivieren, um es nativ in ioBroker auszuführen",
    "lblEncryptionKey": "Standardverschlüsselungsschlüssel",
    "lblHeaderConnect": "So verbinden Sie ein ESPHome-fähiges Gerät mit ioBroker",
    "lblHeaderMainPage": "ESPHome Dashboard-Integration",
    "lblIgnoreList": "IP-Adressen, die von der Geräteerkennung ausgeschlossen werden sollen",
    "lblInputApiPassword": "API-Passwort",
    "lblInputDeviceIP-content": "Geräte-IP-Adresse",
    "lblInputEncryptionKey": "Verschlüsselungsschlüssel",
    "lblLoadDevices": "Geräteübersicht aktualisieren",
    "lblTxtNoButtonsIfNotActive": "Gerätetabelle und Schaltfläche HINZUFÜGEN/Löschen nur verfügbar, wenn der Adapter ausgeführt wird",
    "lbl_addUpdateDevice": "Geräte hinzufügen/ändern",
    "maxRetry": "Maximale Verbindungswiederholung, bevor das Gerät als offline betrachtet wird",
    "newDevicesHeader": "Neu entdeckte Geräte, bitte Anmeldedaten angeben!",
    "reConInterval": "Einstellung zwischen ioBroker versucht, dieses Gerät erneut zu verbinden"
}
