{
    "ESPHomeCommunityLink": "Для отримання додаткової інформації про ESPHome, приклади конфігурації та посилання на спільноти відвідайте:",
    "chkEnableESPHome": "Увімкнути ESPHome Dashboard",
    "existDevicesHeader": "Усі пристрої, якими керує цей адаптер, та їхній стан підключення",
    "hlpDiscoveryListeningAddress": "Виявляти пристрої тільки на цьому інтерфейсі",
    "hlpESPHomeDashboardVersion": "Виберіть версію ESPHome Dashboard для використання",
    "hlpInputApiPassword": "Пароль API (застарілий, використовуйте ключ шифрування!)",
    "hlpInputDeviceIP": "Виберіть існуючий пристрій або введіть IP нового пристрою",
    "hlpInputEncryptionKey": "Вкажіть ключ шифрування для конкретного пристрою (рекомендується)",
    "introLine-1": "ioBroker ESPHome дозволяє керувати пристроями ESPHome, ви повинні створити та завантажити ці бінарні файли самостійно!",
    "introLine-2": "ESPHome Dashboard потрібен для створення цих бінарних файлів. Як тільки прошивка пристрою завантажена та працює, ESPHome Dashboard більше не потрібен для зв'язку з ioBroker",
    "lblApiPass": "Пароль API (застарілий)",
    "lblAutoDiscovery": "Виявлення пристроїв увімкнено",
    "lblConnectDetails-Line-1": "Нативний API ESPHome використовується для прямого зв'язку з клієнтами за допомогою високо оптимізованого мережевого протоколу. Нативний API має багато переваг над використанням MQTT для зв'язку з програмним забезпеченням домашньої автоматизації.",
    "lblConnectDetails-Line-2": "Після додавання рядка api: до конфігурації ESPHome ви можете перейти на цю сторінку та дочекатися появи пристрою ESPHome в розділі виявлених пристроїв (може зайняти до 5 хвилин) або додати пристрій вручну, вибравши \"додати пристрій\" з огляду пристроїв та ввівши \"<NODE_NAME>.local\" або IP-адресу пристрою в поле \"Хост\".",
    "lblConnectDetails-Line-3": "Нативний API ESPHome базується на спеціальному TCP протоколі, що використовує protocol buffers. Ви можете знайти визначення структури даних протоколу тут:",
    "lblConnectIobroker": "ioBroker взаємодіє безпосередньо через нативний API замість MQTT, щоб забезпечити найкращий досвід та підтримку ключів шифрування (рекомендується) замість паролів API/MQTT",
    "lblDashboardLink": "Щоб показати ESPHome dashboard у вкладці адміністратора ioBroker, потрібно вказати IP-адресу, на якій працює установка. Https наразі не підтримується",
    "lblDefaultCredentials": "Налаштування ключів API / шифрування за замовчуванням для пристроїв (не рекомендується)",
    "lblDefaultCredentials-Line-1": "Кожен пристрій повинен мати свій унікальний ключ шифрування (рекомендується) або пароль API, виявлення пристроїв (коли увімкнено) виявляє всі пристрої та намагається підключитися з обліковими даними нижче",
    "lblDefaultCredentials-Line-2": "Якщо ви призначите унікальний ключ шифрування (рекомендується) або пароль API, нові пристрої з'являться на вкладці виявлених пристроїв (або повинні бути додані) і ви повинні вказати унікальні облікові дані вручну",
    "lblDelDevice": "Видалити пристрій",
    "lblDevicesTable": "Усі поточні (відомі) пристрої та їхній стан підключення",
    "lblDiscoveryListeningAddress": "Адреса прослуховування",
    "lblESPHomeDashboardVersion": "Версія ESPHome Dashboard",
    "lblESPHomeIP": "IP-адреса, де працює ESPHome Dashboard для інтеграції в адміністратор ioBroker",
    "lblESPHomePort": "Порт ESPHome Dashboard",
    "lblEnableESPHome": "Ви можете запустити ESPHome Dashboard окремо або активувати опцію нижче для запуску його нативно в ioBroker",
    "lblEncryptionKey": "Ключ шифрування за замовчуванням",
    "lblHeaderConnect": "Як підключити пристрій ESPHome до ioBroker",
    "lblHeaderMainPage": "Інтеграція ESPHome Dashboard",
    "lblHeaderYamlManagement": "YAML File Management",
    "lblIgnoreList": "IP-адреси, які виключаються з виявлення пристроїв",
    "lblInputApiPassword": "Пароль API",
    "lblInputDeviceIP-content": "IP-адреса пристрою",
    "lblInputEncryptionKey": "Ключ шифрування",
    "lblLoadDevices": "Оновити огляд пристроїв",
    "lblRefreshYamlFiles": "Refresh File List",
    "lblTxtNoButtonsIfNotActive": "Таблиця пристроїв та кнопки ДОДАТИ / Видалити доступні тільки якщо адаптер працює",
    "lblUploadYamlHeader": "Upload YAML File",
    "lblYamlFileUpload": "Upload YAML File",
    "lblYamlFilesHeader": "Available YAML Files",
    "lblYamlFilesTable": "YAML files in ESPHome directory",
    "lblYamlManagementInfo": "Upload, download, and manage YAML configuration files for your ESPHome devices. Files are stored in the ESPHome directory and can be used by the ESPHome Dashboard.",
    "lbl_addUpdateDevice": "ДОДАТИ / Змінити пристрої",
    "maxRetry": "Максимальна кількість спроб підключення перед тим, як вважати пристрій офлайн",
    "newDevicesHeader": "Нещодавно виявлені пристрої, будь ласка, надайте облікові дані!",
    "reConInterval": "Інтервал між спробами ioBroker повторно підключитися до цього пристрою"
}
