{
    "ESPHomeCommunityLink": "Więcej informacji o ESPHome, przykładową konfigurację i linki do społeczności można znaleźć na stronie:",
    "chkEnableESPHome": "Włącz panel ESPHome",
    "cnfDeleteYamlCancel": "Cancel",
    "cnfDeleteYamlOk": "Delete",
    "cnfDeleteYamlText": "Are you sure you want to delete this file?",
    "cnfDeleteYamlTitle": "Confirm file deletion",
    "existDevicesHeader": "Wszystkie urządzenia zarządzane przez tę kartę i ich stan połączenia",
    "hlpDiscoveryListeningAddress": "Odkrywaj tylko urządzenia na tym interfejsie",
    "hlpESPHomeDashboardVersion": "Wybierz, która wersja panelu ESPHome ma być używana",
    "hlpInputApiPassword": "Hasło API (starsze, użyj klucza szyfrującego!)",
    "hlpInputDeviceIP": "Wybierz istniejące urządzenie lub wprowadź adres IP nowego urządzenia",
    "hlpInputEncryptionKey": "Podaj klucz szyfrowania specyficzny dla urządzenia (preferowany)",
    "hlpSelectedFilename": "Enter the filename from the table above to download or delete it",
    "introLine-1": "ioBroker ESPHome pozwala zarządzać i kontrolować urządzenia obsługujące ESPHome, musisz samodzielnie utworzyć i przesłać te pliki binarne!",
    "introLine-2": "Do zbudowania tych plików binarnych wymagany jest panel ESPHome Dashboard. ",
    "lblApiPass": "Domyślne hasło do natywnego API (starsze)",
    "lblAutoDiscovery": "Włączono wykrywanie urządzeń",
    "lblConnectDetails-Line-1": "Natywny interfejs API ESPHome służy do bezpośredniej komunikacji z klientami za pomocą wysoce zoptymalizowanego protokołu sieciowego. ",
    "lblConnectDetails-Line-2": "Po dodaniu linii api: do konfiguracji ESPHome możesz przejść na tę stronę i poczekać, aż urządzenie ESPHome pojawi się w sekcji wykrytych urządzeń (może to zająć do 5 minut) lub dodać urządzenie ręcznie, wybierając „dodaj urządzenie” ",
    "lblConnectDetails-Line-3": "Natywny interfejs API ESPHome opiera się na niestandardowym protokole TCP wykorzystującym bufory protokołów. ",
    "lblConnectIobroker": "ioBroker komunikuje się bezpośrednio przez Native API zamiast MQTT, aby zapewnić najlepszą możliwą obsługę i obsługę kluczy szyfrujących (zalecane) zamiast haseł API/MQTT",
    "lblDashboardLink": "Aby wyświetlić panel ESPHome w zakładce administracyjnej ioBroker, wymagane jest podanie adresu IP, na którym działa instalacja",
    "lblDefaultCredentials": "Domyślne ustawienia API/kluczy szyfrujących urządzenia (niezalecane)",
    "lblDefaultCredentials-Line-1": "Każde urządzenie powinno mieć swój własny, unikalny klucz szyfrowania (zalecane) lub hasło API. Funkcja wykrywania urządzeń (jeśli jest włączona) wykrywa wszystkie urządzenia i próbuje połączyć się przy użyciu poniższych danych uwierzytelniających",
    "lblDefaultCredentials-Line-2": "Jeśli przypiszesz unikalny klucz szyfrowania (zalecane) lub hasło API, nowe urządzenia pojawią się na karcie Wykryte urządzenia (lub muszą zostać dodane) i musisz ręcznie podać unikalne dane uwierzytelniające",
    "lblDelDevice": "Usuń urządzenie",
    "lblDeleteYamlButton": "Delete File",
    "lblDevicesTable": "Wszystkie aktualne (znane) urządzenia i stan ich połączenia",
    "lblDiscoveryListeningAddress": "Adres słuchania",
    "lblDownloadYamlButton": "Download File",
    "lblESPHomeDashboardVersion": "Wersja panelu ESPHome",
    "lblESPHomeIP": "Adres IP, na którym działa panel ESPHome Dashboard w celu integracji z administratorem ioBroker",
    "lblESPHomePort": "Port panelu ESPHome",
    "lblEnableESPHome": "Możesz uruchomić panel ESPHome osobno lub aktywować poniższą opcję, aby uruchomić go natywnie w ioBroker",
    "lblEncryptionKey": "Domyślny klucz szyfrowania",
    "lblFileActionsHeader": "File Actions",
    "lblHeaderConnect": "Jak podłączyć urządzenie obsługujące ESPHome do ioBroker",
    "lblHeaderMainPage": "Integracja z panelem ESPHome",
    "lblHeaderYamlManagement": "YAML File Management",
    "lblIgnoreList": "Adresy IP, które mają być wykluczone przy wykrywaniu urządzenia",
    "lblInputApiPassword": "Hasło API",
    "lblInputDeviceIP-content": "Adres IP urządzenia",
    "lblInputEncryptionKey": "Klucz szyfrowania",
    "lblLoadDevices": "Odśwież przegląd urządzeń",
    "lblRefreshYamlFiles": "Refresh File List",
    "lblSelectedFilename": "Select file for download/delete",
    "lblTxtNoButtonsIfNotActive": "Tabela urządzeń i przycisk DODAJ/Usuń dostępne tylko wtedy, gdy adapter jest uruchomiony",
    "lblUploadContent": "YAML Content",
    "lblUploadFilename": "Filename (e.g., my-device.yaml)",
    "lblUploadYamlButton": "Upload File",
    "lblUploadYamlHeader": "Upload YAML File",
    "lblUploadYamlInfo": "Paste the content of your YAML file below and provide a filename to upload it to the ESPHome directory.",
    "lblYamlFileUpload": "Upload YAML File",
    "lblYamlFilesHeader": "Available YAML Files",
    "lblYamlFilesTable": "YAML files in ESPHome directory",
    "lblYamlManagementInfo": "Upload, download, and manage YAML configuration files for your ESPHome devices. Files are stored in the ESPHome directory and can be used by the ESPHome Dashboard.",
    "lbl_addUpdateDevice": "DODAJ/Modyfikuj urządzenia",
    "maxRetry": "Maksymalna liczba ponownych prób połączenia przed uznaniem urządzenia za offline",
    "newDevicesHeader": "Nowo odkryte urządzenia. Podaj dane uwierzytelniające!",
    "reConInterval": "Ustawienie między próbą ponownego podłączenia tego urządzenia przez ioBroker",
    "lblClearAutopyCache": "Clear Autopy Cache",
    "hlpClearAutopyCache": "Clear the autopy cache directory. This can help resolve issues with the ESPHome Dashboard not loading properly.",
    "cnfClearCacheText": "Are you sure you want to clear the autopy cache? This will remove all cached Python environments and ESPHome installations.",
    "cnfClearCacheTitle": "Confirm cache clearing",
    "cnfClearCacheOk": "Clear Cache",
    "cnfClearCacheCancel": "Cancel"
}
