{
    "ESPHomeCommunityLink": "Для получения дополнительной информации о ESPHome, примерах конфигурации и ссылках на сообщества посетите:",
    "chkEnableESPHome": "Включить панель управления ESPHome",
    "cnfDeleteYamlCancel": "Cancel",
    "cnfDeleteYamlOk": "Delete",
    "cnfDeleteYamlText": "Are you sure you want to delete this file?",
    "cnfDeleteYamlTitle": "Confirm file deletion",
    "existDevicesHeader": "Все устройства, управляемые этим адаптером, и состояние их подключения",
    "hlpDiscoveryListeningAddress": "Обнаруживать устройства только на этом интерфейсе",
    "hlpESPHomeDashboardVersion": "Выберите, какую версию ESPHome Dashboard необходимо использовать.",
    "hlpInputApiPassword": "Пароль API (устаревший, используйте ключ шифрования!)",
    "hlpInputDeviceIP": "Выберите существующее устройство или введите IP нового устройства.",
    "hlpInputEncryptionKey": "Предоставьте ключ шифрования для конкретного устройства (предпочтительно)",
    "hlpSelectedFilename": "Enter the filename from the table above to download or delete it",
    "introLine-1": "ioBroker ESPHome позволяет управлять устройствами, поддерживающими ESPHome, вы должны создавать и загружать эти двоичные файлы самостоятельно!",
    "introLine-2": "Для сборки этих двоичных файлов требуется ESPHome Dashboard. ",
    "lblApiPass": "Собственный пароль API по умолчанию (устаревший)",
    "lblAutoDiscovery": "Обнаружение устройств включено",
    "lblConnectDetails-Line-1": "Собственный API ESPHome используется для прямой связи с клиентами с помощью высокооптимизированного сетевого протокола. ",
    "lblConnectDetails-Line-2": "После добавления строки api: в вашу конфигурацию ESPHome вы можете перейти на эту страницу и подождать, пока устройство ESPHome появится в разделе обнаруженных устройств (это может занять до 5 минут) или добавить устройство вручную, выбрав «Добавить устройство». ",
    "lblConnectDetails-Line-3": "Собственный API ESPHome основан на специальном протоколе TCP с использованием буферов протокола. ",
    "lblConnectIobroker": "ioBroker взаимодействует напрямую через Native API вместо MQTT, чтобы предоставить вам наилучшие возможности и поддержку ключей шифрования (рекомендуется) вместо паролей API/MQTT.",
    "lblDashboardLink": "Чтобы отобразить панель управления ESPHome на вкладке администрирования ioBroker, необходимо указать IP-Ares, на котором выполняется установка.",
    "lblDefaultCredentials": "Устройства настройки API/ключей шифрования по умолчанию (не рекомендуется)",
    "lblDefaultCredentials-Line-1": "Каждое устройство должно иметь свой собственный уникальный ключ шифрования (рекомендуется) или пароль API. Обнаружение устройств (если включено) обнаруживает все устройства и пытается подключиться с учетными данными, указанными ниже.",
    "lblDefaultCredentials-Line-2": "Если вы назначите уникальный ключ шифрования (рекомендуется) или пароль API, новые устройства будут отображаться на вкладке «Обнаруженные устройства» (или их необходимо будет добавить), и вам придется предоставить уникальные учетные данные вручную.",
    "lblDelDevice": "Удалить устройство",
    "lblDeleteYamlButton": "Delete File",
    "lblDevicesTable": "Все текущие (известные) устройства и состояние их подключения",
    "lblDiscoveryListeningAddress": "Адрес прослушивания",
    "lblDownloadYamlButton": "Download File",
    "lblESPHomeDashboardVersion": "Версия панели управления ESPHome",
    "lblESPHomeIP": "IP-адрес, на котором работает панель управления ESPHome, для интеграции в администрацию ioBroker.",
    "lblESPHomePort": "Панель управления портом ESPHome",
    "lblEnableESPHome": "Вы можете запустить панель ESPHome Dashboard отдельно или активировать опцию ниже, чтобы запустить ее в ioBroker.",
    "lblEncryptionKey": "Ключ шифрования по умолчанию",
    "lblFileActionsHeader": "File Actions",
    "lblHeaderConnect": "Как подключить устройство с поддержкой ESPHome к ioBroker",
    "lblHeaderMainPage": "Интеграция панели управления ESPHome",
    "lblHeaderYamlManagement": "YAML File Management",
    "lblIgnoreList": "IP-адреса, которые будут исключены при обнаружении устройства",
    "lblInputApiPassword": "Пароль API",
    "lblInputDeviceIP-content": "IP-адрес устройства",
    "lblInputEncryptionKey": "Ключ шифрования",
    "lblLoadDevices": "Обновить обзор устройства",
    "lblRefreshYamlFiles": "Refresh File List",
    "lblSelectedFilename": "Select file for download/delete",
    "lblTxtNoButtonsIfNotActive": "Таблица устройств и кнопка «Добавить/Удалить» доступны только при работающем адаптере.",
    "lblUploadContent": "YAML Content",
    "lblUploadFilename": "Filename (e.g., my-device.yaml)",
    "lblUploadYamlButton": "Upload File",
    "lblUploadYamlHeader": "Upload YAML File",
    "lblUploadYamlInfo": "Paste the content of your YAML file below and provide a filename to upload it to the ESPHome directory.",
    "lblYamlFileUpload": "Upload YAML File",
    "lblYamlFilesHeader": "Available YAML Files",
    "lblYamlFilesTable": "YAML files in ESPHome directory",
    "lblYamlManagementInfo": "Upload, download, and manage YAML configuration files for your ESPHome devices. Files are stored in the ESPHome directory and can be used by the ESPHome Dashboard.",
    "lbl_addUpdateDevice": "ДОБАВИТЬ/ИЗМЕНИТЬ УСТРОЙСТВА",
    "maxRetry": "Максимальное количество повторных попыток подключения, прежде чем устройство будет считаться отключенным",
    "newDevicesHeader": "Недавно обнаруженные устройства, предоставьте учетные данные!",
    "reConInterval": "Настройка между попытками ioBroker повторно подключить это устройство",
    "lblClearAutopyCache": "Clear Autopy Cache",
    "hlpClearAutopyCache": "Clear the autopy cache directory. This can help resolve issues with the ESPHome Dashboard not loading properly.",
    "cnfClearCacheText": "Are you sure you want to clear the autopy cache? This will remove all cached Python environments and ESPHome installations.",
    "cnfClearCacheTitle": "Confirm cache clearing",
    "cnfClearCacheOk": "Clear Cache",
    "cnfClearCacheCancel": "Cancel"
}
