{
    "ESPHomeCommunityLink": "Для получения дополнительной информации о ESPHome, примерах конфигурации и ссылках на сообщества посетите:",
    "chkEnableESPHome": "Включить панель управления ESPHome",
    "hlpDiscoveryListeningAddress": "Обнаруживать устройства только на этом интерфейсе",
    "hlpInputApiPassword": "Пароль API (устаревший, используйте ключ шифрования!)",
    "hlpInputDeviceIP": "Выберите существующее устройство или введите IP нового устройства.",
    "hlpInputEncryptionKey": "Предоставьте ключ шифрования для конкретного устройства (предпочтительно)",
    "introLine-1": "ioBroker ESPHome позволяет управлять устройствами, поддерживающими ESPHome, вы должны создавать и загружать эти двоичные файлы самостоятельно!",
    "introLine-2": "Для сборки этих двоичных файлов требуется ESPHome Dashboard. ",
    "lblApiPass": "Собственный пароль API по умолчанию (устаревший)",
    "lblAutoDiscovery": "Обнаружение устройств включено",
    "lblConnectDetails-Line-1": "Собственный API ESPHome используется для прямой связи с клиентами с помощью высокооптимизированного сетевого протокола. ",
    "lblConnectDetails-Line-2": "После добавления строки api: в вашу конфигурацию ESPHome вы можете перейти на эту страницу и подождать, пока устройство ESPHome появится в разделе обнаруженных устройств (это может занять до 5 минут) или добавить устройство вручную, выбрав «Добавить устройство». ",
    "lblConnectDetails-Line-3": "Собственный API ESPHome основан на специальном протоколе TCP с использованием буферов протокола. ",
    "lblConnectIobroker": "ioBroker взаимодействует напрямую через Native API вместо MQTT, чтобы предоставить вам наилучшие возможности и поддержку ключей шифрования (рекомендуется) вместо паролей API/MQTT.",
    "lblDashboardLink": "Чтобы отобразить панель управления ESPHome на вкладке администрирования ioBroker, необходимо указать IP-Ares, на котором выполняется установка.",
    "lblDefaultCredentials": "Устройства настройки API/ключей шифрования по умолчанию (не рекомендуется)",
    "lblDefaultCredentials-Line-1": "Каждое устройство должно иметь свой собственный уникальный ключ шифрования (рекомендуется) или пароль API. Обнаружение устройств (если включено) обнаруживает все устройства и пытается подключиться с учетными данными, указанными ниже.",
    "lblDefaultCredentials-Line-2": "Если вы назначите уникальный ключ шифрования (рекомендуется) или пароль API, новые устройства будут отображаться на вкладке «Обнаруженные устройства» (или их необходимо будет добавить), и вам придется предоставить уникальные учетные данные вручную.",
    "lblDelDevice": "Удалить устройство",
    "lblDevicesTable": "Все текущие (известные) устройства и состояние их подключения",
    "lblDiscoveryListeningAddress": "Адрес прослушивания",
    "lblESPHomeIP": "IP-адрес, на котором работает панель управления ESPHome, для интеграции в администрацию ioBroker.",
    "lblESPHomePort": "Панель управления портом ESPHome",
    "lblEnableESPHome": "Вы можете запустить панель ESPHome Dashboard отдельно или активировать опцию ниже, чтобы запустить ее в ioBroker.",
    "lblEncryptionKey": "Ключ шифрования по умолчанию",
    "lblHeaderConnect": "Как подключить устройство с поддержкой ESPHome к ioBroker",
    "lblHeaderMainPage": "Интеграция панели управления ESPHome",
    "lblIgnoreList": "IP-адреса, которые будут исключены при обнаружении устройства",
    "lblInputApiPassword": "Пароль API",
    "lblInputDeviceIP-content": "IP-адрес устройства",
    "lblInputEncryptionKey": "Ключ шифрования",
    "lblLoadDevices": "Обновить обзор устройства",
    "lblTxtNoButtonsIfNotActive": "Таблица устройств и кнопка «Добавить/Удалить» доступны только при работающем адаптере.",
    "lbl_addUpdateDevice": "ДОБАВИТЬ/ИЗМЕНИТЬ УСТРОЙСТВА",
    "maxRetry": "Максимальное количество повторных попыток подключения, прежде чем устройство будет считаться отключенным",
    "reConInterval": "Настройка между попытками ioBroker повторно подключить это устройство"
}