{
    "ESPHomeCommunityLink": "Para obter mais informações sobre ESPHome, exemplos de configuração e links para comunidades, visite:",
    "chkEnableESPHome": "Habilitar painel ESPHome",
    "cnfDeleteYamlCancel": "Cancel",
    "cnfDeleteYamlOk": "Delete",
    "cnfDeleteYamlText": "Are you sure you want to delete this file?",
    "cnfDeleteYamlTitle": "Confirm file deletion",
    "existDevicesHeader": "Todos os dispositivos gerenciados por este adaptador e seu estado de conexão",
    "hlpDiscoveryListeningAddress": "Descubra apenas dispositivos nesta interface",
    "hlpESPHomeDashboardVersion": "Escolha qual versão do ESPHome Dashboard deve ser usada",
    "hlpPillowVersion": "Choose which version of Pillow must be used",
    "hlpInputApiPassword": "Senha da API (herdada, use a chave de criptografia!)",
    "hlpInputDeviceIP": "Selecione o dispositivo existente ou insira o IP do novo dispositivo",
    "hlpInputEncryptionKey": "Forneça a chave de criptografia específica do dispositivo (preferencial)",
    "hlpSelectedFilename": "Enter the filename from the table above to download or delete it",
    "introLine-1": "ioBroker ESPHome permite gerenciar e controlar dispositivos compatíveis com ESPHome. Você mesmo deve criar e fazer upload desses binários!",
    "introLine-2": "O ESPHome Dashboard é necessário para construir esses binários. ",
    "lblApiPass": "Senha padrão da API nativa (herdada)",
    "lblAutoDiscovery": "Descoberta de dispositivos ativada",
    "lblConnectDetails-Line-1": "A API nativa ESPHome é usada para comunicação direta com os clientes, com um protocolo de rede altamente otimizado. ",
    "lblConnectDetails-Line-2": "Depois de adicionar uma linha api: à configuração do ESPHome, você pode ir para esta página e esperar que o dispositivo ESPHome apareça na seção de dispositivos descobertos (pode levar até 5 minutos) ou adicionar o dispositivo manualmente escolhendo “adicionar dispositivo” ",
    "lblConnectDetails-Line-3": "A API nativa ESPHome é baseada em um protocolo TCP personalizado usando buffers de protocolo. ",
    "lblConnectIobroker": "O ioBroker se comunica diretamente pela API nativa em vez do MQTT para fornecer a melhor experiência possível e suporte de chaves de criptografia (recomendado) em vez de senhas API/MQTT",
    "lblDashboardLink": "Para mostrar o painel do ESPHome na aba de administração do ioBroker, é necessário fornecer os IP-Ares em que a instalação está sendo executada",
    "lblDefaultCredentials": "Dispositivos de configurações de chaves de API/criptografia padrão (não recomendado)",
    "lblDefaultCredentials-Line-1": "Cada dispositivo deve ter sua própria chave de criptografia exclusiva (recomendado) ou senha de API. A descoberta de dispositivos (quando ativada) detecta todos os dispositivos e tenta se conectar com as credenciais abaixo",
    "lblDefaultCredentials-Line-2": "Se você atribuir uma chave de criptografia exclusiva (recomendado) ou uma senha de API, novos dispositivos aparecerão na guia Dispositivos descobertos (ou deverão ser adicionados) e você deverá fornecer as credenciais exclusivas manualmente",
    "lblDelDevice": "Excluir dispositivo",
    "lblDeleteYamlButton": "Delete File",
    "lblDevicesTable": "Todos os dispositivos atuais (conhecidos) e seu estado de conexão",
    "lblDiscoveryListeningAddress": "Endereço de escuta",
    "lblDownloadYamlButton": "Download File",
    "lblESPHomeDashboardVersion": "Versão do painel ESPHome",
    "lblPillowVersion": "Pillow version",
    "lblESPHomeIP": "Endereço IP onde o ESPHome Dashboard está sendo executado para integração no ioBroker Admin",
    "lblESPHomePort": "Painel do Porto do ESPHome",
    "lblEnableESPHome": "Você pode executar o ESPHome Dashboard separadamente ou ativar a opção abaixo para executá-lo nativamente no ioBroker",
    "lblEncryptionKey": "Chave de criptografia padrão",
    "lblFileActionsHeader": "File Actions",
    "lblHeaderConnect": "Como conectar um dispositivo compatível com ESPHome ao ioBroker",
    "lblHeaderMainPage": "Integração do painel ESPHome",
    "lblHeaderYamlManagement": "YAML File Management",
    "lblIgnoreList": "Endereços IP a serem excluídos pela descoberta de dispositivos",
    "lblInputApiPassword": "Senha da API",
    "lblInputDeviceIP-content": "Endereço IP do dispositivo",
    "lblInputEncryptionKey": "Chave de encriptação",
    "lblLoadDevices": "Atualizar visão geral do dispositivo",
    "lblRefreshYamlFiles": "Refresh File List",
    "lblSelectedFilename": "Select file for download/delete",
    "lblTxtNoButtonsIfNotActive": "Tabela de dispositivos e botão ADICIONAR/Excluir disponíveis apenas se o adaptador estiver em execução",
    "lblUploadContent": "YAML Content",
    "lblUploadFilename": "Filename (e.g., my-device.yaml)",
    "lblUploadYamlButton": "Upload File",
    "lblUploadYamlHeader": "Upload YAML File",
    "lblUploadYamlInfo": "Paste the content of your YAML file below and provide a filename to upload it to the ESPHome directory.",
    "lblYamlFileUpload": "Upload YAML File",
    "lblYamlFilesHeader": "Available YAML Files",
    "lblYamlFilesTable": "YAML files in ESPHome directory",
    "lblYamlManagementInfo": "Upload, download, and manage YAML configuration files for your ESPHome devices. Files are stored in the ESPHome directory and can be used by the ESPHome Dashboard.",
    "lbl_addUpdateDevice": "ADICIONAR/Modificar Dispositivos",
    "maxRetry": "Tentativa máxima de conexão antes de considerar o dispositivo como off-line",
    "newDevicesHeader": "Dispositivos recém-descobertos, forneça credenciais!",
    "reConInterval": "Configuração entre tentativas do ioBroker para reconectar este dispositivo",
    "lblClearAutopyCache": "Clear Autopy Cache",
    "hlpClearAutopyCache": "Clear the autopy cache directory. This can help resolve issues with the ESPHome Dashboard not loading properly.",
    "cnfClearCacheText": "Are you sure you want to clear the autopy cache? This will remove all cached Python environments and ESPHome installations.",
    "cnfClearCacheTitle": "Confirm cache clearing",
    "cnfClearCacheOk": "Clear Cache",
    "cnfClearCacheCancel": "Cancel",
    "lblConfigStates": "Show configuration states",
    "hlpConfigStates": "Create configuration states for each entity to show device configuration details"
}
