{
    "ESPHomeCommunityLink": "For more information about ESPHome, example configuration and links to communities please visit:",
    "chkEnableESPHome": "Enable ESPHome Dashboard",
    "hlpDiscoveryListeningAddress": "Only discover devices on this interface",
    "hlpInputApiPassword": "API password (legacy, please use encryption key!)",
    "hlpInputDeviceIP": "Select existing device or Enter IP of new device",
    "hlpInputEncryptionKey": "Provide device specific Encryption Key (preferred)",
    "introLine-1": "ioBroker ESPHome allows to manage and control ESPHome capable devices, you must create and upload these binaries by yourself!",
    "introLine-2": "ESPHome Dashboard is required to build these binaries. As soon a device firmware is flashed and operational, ESPHome Dashboard is not required anymore to allow communications with ioBroker",
    "lblApiPass": "API password (legacy)",
    "lblAutoDiscovery": "Device Discovery enabled",
    "lblConnectDetails-Line-1": "The ESPHome native API is used to communicate with clients directly, with a highly-optimized network protocol. Native API has many advantages over using MQTT for communication with Home Automation software ",
    "lblConnectDetails-Line-2": "After adding an api: line to your ESPHome configuration you can go to this page and and wait for the ESPHome device to show up under the discovered devices section (can take up to 5 minutes) or add the device manually by choosing “add Device” from the devices overview and entering “<NODE_NAME>.local” or the IP address of the unit in the “Host” field.",
    "lblConnectDetails-Line-3": "The ESPHome native API is based on a custom TCP protocol using protocol buffers. You can find the protocol data structure definitions here:",
    "lblConnectIobroker": "ioBroker communicates directly by Native API instead of MQTT to provide you the best possible experience and support of encryption keys (recommend) instead of API/MQTT passwords",
    "lblDashboardLink": "To show ESPHome dashboard in ioBroker admin tab, its required to provide the IP-Ares on which installation its running",
    "lblDefaultCredentials": "Default API / Encryption keys settings devices (not recommended)",
    "lblDefaultCredentials-Line-1": "Each devices should have its own unique encryption Key (recommended) or API password, device discovery (when enabled) detects all devices and tries to connect with credentials below",
    "lblDefaultCredentials-Line-2": "If you assign an unique encryption key (recommended) or API password, new devices will show up on Discovered Devices tab (or must be added) and you must provide the unique credentials manually",
    "lblDelDevice": "Delete Device",
    "lblDevicesTable": "All current (known) devices and their connection state",
    "lblDiscoveryListeningAddress": "Listening address",
    "lblESPHomeIP": "IP-Address where ESPHome Dashboard is running to integrate in ioBroker Admin",
    "lblESPHomePort": "Port of ESPHome Dashboard",
    "lblEnableESPHome": "You can either run ESPHome Dashboard separately, or activate the option below to run it native in ioBroker",
    "lblEncryptionKey": "Default encryption Key",
    "lblHeaderConnect": "How to connect an ESPHome capable device to ioBroker",
    "lblHeaderMainPage": "ESPHome Dashboard integration",
    "lblIgnoreList": "IP-Addresses to be excluded by device discovery",
    "lblInputApiPassword": "API password",
    "lblInputDeviceIP-content": "Device IP-Address",
    "lblInputEncryptionKey": "Encryption Key",
    "lblLoadDevices": "Refresh device overview",
    "lblTxtNoButtonsIfNotActive": "Device table & ADD / Delete button only available if adapter is running",
    "lbl_addUpdateDevice": "ADD / Modify Devices",
    "maxRetry": "Maximum connection retry before considering device as offline",
    "reConInterval": "Setting between ioBroker try's to reconnect this device"
}