{
    "ESPHomeCommunityLink": "Pour plus d'informations sur ESPHome, des exemples de configuration et des liens vers les communautés, veuillez visiter :",
    "chkEnableESPHome": "Activer le tableau de bord ESPHome",
    "existDevicesHeader": "Tous les appareils gérés par cet adaptateur et leur état de connexion",
    "hlpDiscoveryListeningAddress": "Découvrez uniquement les appareils sur cette interface",
    "hlpESPHomeDashboardVersion": "Choisissez quelle version d'ESPHome Dashboard doit être utilisée",
    "hlpInputApiPassword": "Mot de passe API (ancien, veuillez utiliser la clé de cryptage !)",
    "hlpInputDeviceIP": "Sélectionnez l'appareil existant ou entrez l'adresse IP du nouvel appareil",
    "hlpInputEncryptionKey": "Fournir une clé de cryptage spécifique à l'appareil (de préférence)",
    "hlpSelectedFilename": "Enter the filename from the table above to download or delete it",
    "introLine-1": "ioBroker ESPHome permet de gérer et de contrôler les appareils compatibles ESPHome, vous devez créer et télécharger ces binaires par vous-même !",
    "introLine-2": "ESPHome Dashboard est requis pour créer ces binaires. ",
    "lblApiPass": "Mot de passe de l'API native par défaut (ancien)",
    "lblAutoDiscovery": "Découverte de périphérique activée",
    "lblConnectDetails-Line-1": "L'API native ESPHome est utilisée pour communiquer directement avec les clients, avec un protocole réseau hautement optimisé. ",
    "lblConnectDetails-Line-2": "Après avoir ajouté une ligne api: à votre configuration ESPHome, vous pouvez accéder à cette page et attendre que l'appareil ESPHome apparaisse dans la section des appareils découverts (cela peut prendre jusqu'à 5 minutes) ou ajouter l'appareil manuellement en choisissant « ajouter un appareil ». ",
    "lblConnectDetails-Line-3": "L'API native ESPHome est basée sur un protocole TCP personnalisé utilisant des tampons de protocole. ",
    "lblConnectIobroker": "ioBroker communique directement par API native au lieu de MQTT pour vous offrir la meilleure expérience possible et la prise en charge des clés de chiffrement (recommandé) au lieu des mots de passe API/MQTT",
    "lblDashboardLink": "Pour afficher le tableau de bord ESPHome dans l'onglet d'administration d'ioBroker, il est nécessaire de fournir l'IP-Ares sur lequel l'installation est en cours d'exécution.",
    "lblDefaultCredentials": "Appareils de paramètres API/clés de cryptage par défaut (non recommandé)",
    "lblDefaultCredentials-Line-1": "Chaque appareil doit avoir sa propre clé de cryptage unique (recommandée) ou son propre mot de passe API, la découverte des appareils (lorsqu'elle est activée) détecte tous les appareils et tente de se connecter avec les informations d'identification ci-dessous.",
    "lblDefaultCredentials-Line-2": "Si vous attribuez une clé de cryptage unique (recommandé) ou un mot de passe API, les nouveaux appareils apparaîtront dans l'onglet Appareils découverts (ou doivent être ajoutés) et vous devez fournir les informations d'identification uniques manuellement.",
    "lblDelDevice": "Supprimer l'appareil",
    "lblDeleteYamlButton": "Delete File",
    "lblDevicesTable": "Tous les appareils actuels (connus) et leur état de connexion",
    "lblDiscoveryListeningAddress": "Adresse d'écoute",
    "lblDownloadYamlButton": "Download File",
    "lblESPHomeDashboardVersion": "Version du tableau de bord ESPHome",
    "lblESPHomeIP": "Adresse IP sur laquelle ESPHome Dashboard est exécuté pour s'intégrer dans ioBroker Admin",
    "lblESPHomePort": "Port du tableau de bord ESPHome",
    "lblEnableESPHome": "Vous pouvez soit exécuter ESPHome Dashboard séparément, soit activer l'option ci-dessous pour l'exécuter nativement dans ioBroker",
    "lblEncryptionKey": "Clé de cryptage par défaut",
    "lblFileActionsHeader": "File Actions",
    "lblHeaderConnect": "Comment connecter un appareil compatible ESPHome à ioBroker",
    "lblHeaderMainPage": "Intégration du tableau de bord ESPHome",
    "lblHeaderYamlManagement": "YAML File Management",
    "lblIgnoreList": "Adresses IP à exclure par la découverte de périphériques",
    "lblInputApiPassword": "Mot de passe API",
    "lblInputDeviceIP-content": "Adresse IP de l'appareil",
    "lblInputEncryptionKey": "Clé de cryptage",
    "lblLoadDevices": "Actualiser la présentation des appareils",
    "lblRefreshYamlFiles": "Refresh File List",
    "lblSelectedFilename": "Select file for download/delete",
    "lblTxtNoButtonsIfNotActive": "Tableau des appareils et bouton AJOUTER/Supprimer disponibles uniquement si l'adaptateur est en cours d'exécution",
    "lblUploadContent": "YAML Content",
    "lblUploadFilename": "Filename (e.g., my-device.yaml)",
    "lblUploadYamlButton": "Upload File",
    "lblUploadYamlHeader": "Upload YAML File",
    "lblUploadYamlInfo": "Paste the content of your YAML file below and provide a filename to upload it to the ESPHome directory.",
    "lblYamlFileUpload": "Upload YAML File",
    "lblYamlFilesHeader": "Available YAML Files",
    "lblYamlFilesTable": "YAML files in ESPHome directory",
    "lblYamlManagementInfo": "Upload, download, and manage YAML configuration files for your ESPHome devices. Files are stored in the ESPHome directory and can be used by the ESPHome Dashboard.",
    "lbl_addUpdateDevice": "AJOUTER/Modifier des appareils",
    "maxRetry": "Nombre maximal de tentatives de connexion avant de considérer l'appareil comme hors ligne",
    "newDevicesHeader": "Appareils récemment découverts, veuillez fournir vos informations d'identification !",
    "reConInterval": "Paramètres entre ioBroker essayant de reconnecter cet appareil"
}
